package com.day20;

public class Test01 {


    //. 网络通讯的三要素是什么？以及各自的作用？
//    语义、语法、时序。
//            1.语义：对构成协议的协议元素含义的解释（讲什么），特定的符号或数值。
//            2.语法：（要素之间的排列规则和格式）用于规定将若干个协议元素和数据组合在一起来表达一个更完整的内容是所应遵循的格式，即对所表达的内容的数据结构形式的一种规定（对更低层次则表现为编码格式和信号水平）（怎么讲）
//            3.时序：（TCP三次握手）通信中各事件发生的因果关系，时序规定了某个通信事件及其由它而触发的一系列后续事件的执行顺序。
//            4. 网络协议的实质：实体间通信时所使用的一种语言。

    // 2. 简述UDP协议和TCP协议各自的特点

//              TCP）传输控制协议，是一种提供可靠数据传输的通用协议。
//              （UDP）用户数据报协议，是一个面向无连接的协议。
//              采用该协议不需要两个应用程序先建立连接。UDP协议不提供差错恢复，不能提供数据重传，因此该协议传输数据安全性差。


}
