package com.day9;

public class Test01 {


//            1. 什么是接口，如何定义接口？
                /* 接口，是Java语言中一种引用类型，是方法的集合。*/
                /*使用interface关键定义接口 ,其中可以定义抽象方法,默认方法,私有方法.静态方法*/
                /*interface 接口名{
                    //抽象方法
                    //默认方法
                    //静态方法
                    //私有方法
}*/
//            2. 什么叫做多态，条件是什么？
                /*  同一行为具有多个不同的表现形式*/
                /* 继承或者实现[二选一]*/
                /* 父类引用指向子类对象*/
                /* 方法的重写*/
//            3. 使用多态特性，带来了什么样的好处？
                /* 增强方法的扩展性和复用性*/
//            4. 使用多态特性，注意什么样的弊端？ 第二题：语法练习
              /* 不能调用子类特有方法  必须向下转型*/
}
